In [1]:
#Fonte de dados:https://www.kaggle.com/datasets/benroshan/ecommerce-data?datasetId=615631

In [2]:
# Import some libraries
import pandas as pd
import numpy as np

In [3]:
# Used to pandas library to read csv files:
df = pd.read_csv('List of Orders.csv')

In [4]:
df

    Order ID  Order Date CustomerName           State       City
0    B-25601  01-04-2018       Bharat         Gujarat  Ahmedabad
1    B-25602  01-04-2018        Pearl     Maharashtra       Pune
2    B-25603  03-04-2018        Jahan  Madhya Pradesh     Bhopal
3    B-25604  03-04-2018       Divsha       Rajasthan     Jaipur
4    B-25605  05-04-2018      Kasheen     West Bengal    Kolkata
..       ...         ...          ...             ...        ...
555      NaN         NaN          NaN             NaN        NaN
556      NaN         NaN          NaN             NaN        NaN
557      NaN         NaN          NaN             NaN        NaN
558      NaN         NaN          NaN             NaN        NaN
559      NaN         NaN          NaN             NaN        NaN

[560 rows x 5 columns]

In [5]:
# head method on pandas, used to dataframes, could show us 5 first lines of our dataset.
df.head()

  Order ID  Order Date CustomerName           State       City
0  B-25601  01-04-2018       Bharat         Gujarat  Ahmedabad
1  B-25602  01-04-2018        Pearl     Maharashtra       Pune
2  B-25603  03-04-2018        Jahan  Madhya Pradesh     Bhopal
3  B-25604  03-04-2018       Divsha       Rajasthan     Jaipur
4  B-25605  05-04-2018      Kasheen     West Bengal    Kolkata

In [6]:
# On the other hands, tail method on pandas library could show us the last 3 lines on our dataset.
df.tail()

    Order ID Order Date CustomerName State City
555      NaN        NaN          NaN   NaN  NaN
556      NaN        NaN          NaN   NaN  NaN
557      NaN        NaN          NaN   NaN  NaN
558      NaN        NaN          NaN   NaN  NaN
559      NaN        NaN          NaN   NaN  NaN

In [7]:
# Counting how many line and columns on our database with shape method.
df.shape #(lines, columns)

(560, 5)

In [8]:
# Show all columns
df.columns

Index(['Order ID', 'Order Date', 'CustomerName', 'State', 'City'], dtype='object')

In [9]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
555     True
556     True
557     True
558     True
559     True
Length: 560, dtype: bool

In [10]:
# How many duplicate line there are on dataset 
df.duplicated().sum()

59

In [11]:
# Show us data about metadata
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 560 entries, 0 to 559
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      500 non-null    object
 1   Order Date    500 non-null    object
 2   CustomerName  500 non-null    object
 3   State         500 non-null    object
 4   City          500 non-null    object
dtypes: object(5)
memory usage: 22.0+ KB

In [12]:
# How many empty space are there?
df.isna().sum()

Order ID        60
Order Date      60
CustomerName    60
State           60
City            60
dtype: int64

In [13]:
# Summary Statistical
df.describe()

       Order ID  Order Date CustomerName           State    City
count       500         500          500             500     500
unique      500         307          332              19      24
top     B-25601  24-11-2018       Shreya  Madhya Pradesh  Indore
freq          1           7            6             101      76

In [14]:
# Summary Statistical, include categorical variables
df.describe(include = 'all')

       Order ID  Order Date CustomerName           State    City
count       500         500          500             500     500
unique      500         307          332              19      24
top     B-25601  24-11-2018       Shreya  Madhya Pradesh  Indore
freq          1           7            6             101      76

In [15]:
# How unique values are there by column?
df.nunique()

Order ID        500
Order Date      307
CustomerName    332
State            19
City             24
dtype: int64

In [16]:
# How many unique states on dataset?
df['State'].unique()

array(['Gujarat', 'Maharashtra', 'Madhya Pradesh', 'Rajasthan',
       'West Bengal', 'Karnataka', 'Jammu and Kashmir', 'Tamil Nadu',
       'Uttar Pradesh', 'Bihar', 'Kerala ', 'Punjab', 'Haryana',
       'Himachal Pradesh', 'Sikkim', 'Goa', 'Nagaland', 'Andhra Pradesh',
       'Delhi', nan], dtype=object)

In [17]:
# How many unique cities on dataset?
df['City'].unique()

array(['Ahmedabad', 'Pune', 'Bhopal', 'Jaipur', 'Kolkata', 'Bangalore',
       'Kashmir', 'Chennai', 'Lucknow', 'Patna', 'Thiruvananthapuram',
       'Chandigarh', 'Simla', 'Gangtok', 'Goa', 'Kohima', 'Hyderabad',
       'Mumbai', 'Indore', 'Surat', 'Udaipur', 'Allahabad', 'Amritsar',
       'Delhi', nan], dtype=object)

In [18]:
# Show us frequency 
df['State'].value_counts()

Madhya Pradesh       101
Maharashtra           90
Rajasthan             32
Gujarat               27
Punjab                25
Uttar Pradesh         22
Delhi                 22
West Bengal           22
Karnataka             21
Kerala                16
Bihar                 16
Nagaland              15
Andhra Pradesh        15
Jammu and Kashmir     14
Haryana               14
Himachal Pradesh      14
Goa                   14
Sikkim                12
Tamil Nadu             8
Name: State, dtype: int64

In [19]:
# creating a new variable, using selected columns
places = ['State', 'City']

In [20]:
df

    Order ID  Order Date CustomerName           State       City
0    B-25601  01-04-2018       Bharat         Gujarat  Ahmedabad
1    B-25602  01-04-2018        Pearl     Maharashtra       Pune
2    B-25603  03-04-2018        Jahan  Madhya Pradesh     Bhopal
3    B-25604  03-04-2018       Divsha       Rajasthan     Jaipur
4    B-25605  05-04-2018      Kasheen     West Bengal    Kolkata
..       ...         ...          ...             ...        ...
555      NaN         NaN          NaN             NaN        NaN
556      NaN         NaN          NaN             NaN        NaN
557      NaN         NaN          NaN             NaN        NaN
558      NaN         NaN          NaN             NaN        NaN
559      NaN         NaN          NaN             NaN        NaN

[560 rows x 5 columns]

In [21]:
# Used to sort values, organizing in order with a especific data (attribute)
df.sort_values(['State'])

    Order ID  Order Date CustomerName           State       City
215  B-25816  12-10-2018         Mane  Andhra Pradesh  Hyderabad
143  B-25744  08-08-2018     Devendra  Andhra Pradesh  Hyderabad
490  B-26091  27-03-2019        Manju  Andhra Pradesh  Hyderabad
233  B-25834  29-10-2018       Ananya  Andhra Pradesh  Hyderabad
197  B-25798  01-10-2018       Shishu  Andhra Pradesh  Hyderabad
..       ...         ...          ...             ...        ...
555      NaN         NaN          NaN             NaN        NaN
556      NaN         NaN          NaN             NaN        NaN
557      NaN         NaN          NaN             NaN        NaN
558      NaN         NaN          NaN             NaN        NaN
559      NaN         NaN          NaN             NaN        NaN

[560 rows x 5 columns]

In [22]:
# Used to sort values, organizing in order with a especific data (attribute)
# Using reset index
df.sort_values(['State']).reset_index(drop = True)

    Order ID  Order Date CustomerName           State       City
0    B-25816  12-10-2018         Mane  Andhra Pradesh  Hyderabad
1    B-25744  08-08-2018     Devendra  Andhra Pradesh  Hyderabad
2    B-26091  27-03-2019        Manju  Andhra Pradesh  Hyderabad
3    B-25834  29-10-2018       Ananya  Andhra Pradesh  Hyderabad
4    B-25798  01-10-2018       Shishu  Andhra Pradesh  Hyderabad
..       ...         ...          ...             ...        ...
555      NaN         NaN          NaN             NaN        NaN
556      NaN         NaN          NaN             NaN        NaN
557      NaN         NaN          NaN             NaN        NaN
558      NaN         NaN          NaN             NaN        NaN
559      NaN         NaN          NaN             NaN        NaN

[560 rows x 5 columns]

In [23]:
# Now, using more than only one attribute
df = df.sort_values(by = places, ascending = False)\
.reset_index(drop = True)

In [24]:
df

    Order ID  Order Date CustomerName        State     City
0    B-25605  05-04-2018      Kasheen  West Bengal  Kolkata
1    B-25623  22-04-2018       Atharv  West Bengal  Kolkata
2    B-25641  27-04-2018      Parishi  West Bengal  Kolkata
3    B-25659  15-05-2018    Sanskriti  West Bengal  Kolkata
4    B-25677  02-06-2018         Ekta  West Bengal  Kolkata
..       ...         ...          ...          ...      ...
555      NaN         NaN          NaN          NaN      NaN
556      NaN         NaN          NaN          NaN      NaN
557      NaN         NaN          NaN          NaN      NaN
558      NaN         NaN          NaN          NaN      NaN
559      NaN         NaN          NaN          NaN      NaN

[560 rows x 5 columns]

In [25]:
time = ['Order Date']

In [26]:
# Imput a calculate column 
df['Count Order Date'] = df[time].count(axis = 1)

In [27]:
df.head()

  Order ID  Order Date CustomerName        State     City  Count Order Date
0  B-25605  05-04-2018      Kasheen  West Bengal  Kolkata                 1
1  B-25623  22-04-2018       Atharv  West Bengal  Kolkata                 1
2  B-25641  27-04-2018      Parishi  West Bengal  Kolkata                 1
3  B-25659  15-05-2018    Sanskriti  West Bengal  Kolkata                 1
4  B-25677  02-06-2018         Ekta  West Bengal  Kolkata                 1

In [28]:
# Query - Different structures #

In [29]:
df.query('(City == "Goa") & (State == "Goa") & (`Order Date` != "01-05-2018")')

    Order ID  Order Date CustomerName State City  Count Order Date
433  B-25616  15-04-2018        Kanak   Goa  Goa                 1
434  B-25634  26-04-2018       Sanjay   Goa  Goa                 1
435  B-25652  08-05-2018      Tushina   Goa  Goa                 1
436  B-25670  25-05-2018      Charika   Goa  Goa                 1
437  B-25706  01-07-2018     Swetlana   Goa  Goa                 1
438  B-25742  03-08-2018       Ashwin   Goa  Goa                 1
439  B-25760  24-08-2018        Pooja   Goa  Goa                 1
440  B-25850  05-11-2018     Abhishek   Goa  Goa                 1
441  B-25868  18-11-2018       Vikash   Goa  Goa                 1
442  B-25940  06-01-2019        Vivek   Goa  Goa                 1
443  B-26026  19-02-2019        Kanak   Goa  Goa                 1
444  B-26044  02-03-2019       Sanjay   Goa  Goa                 1
445  B-26062  15-03-2019      Tushina   Goa  Goa                 1
446  B-26089  26-03-2019        Kanak   Goa  Goa                 1

In [30]:
df[(df['City'] == 'Goa') & (df['State'] == 'Goa') & (df['Order Date'] != '01-10-2018')]

    Order ID  Order Date CustomerName State City  Count Order Date
433  B-25616  15-04-2018        Kanak   Goa  Goa                 1
434  B-25634  26-04-2018       Sanjay   Goa  Goa                 1
435  B-25652  08-05-2018      Tushina   Goa  Goa                 1
436  B-25670  25-05-2018      Charika   Goa  Goa                 1
437  B-25706  01-07-2018     Swetlana   Goa  Goa                 1
438  B-25742  03-08-2018       Ashwin   Goa  Goa                 1
439  B-25760  24-08-2018        Pooja   Goa  Goa                 1
440  B-25850  05-11-2018     Abhishek   Goa  Goa                 1
441  B-25868  18-11-2018       Vikash   Goa  Goa                 1
442  B-25940  06-01-2019        Vivek   Goa  Goa                 1
443  B-26026  19-02-2019        Kanak   Goa  Goa                 1
444  B-26044  02-03-2019       Sanjay   Goa  Goa                 1
445  B-26062  15-03-2019      Tushina   Goa  Goa                 1
446  B-26089  26-03-2019        Kanak   Goa  Goa                 1

In [31]:
df.loc[(df['City'] == 'Goa') & (df['State'] == 'Goa') & (df['Order Date'] != '01-05-2019')]

    Order ID  Order Date CustomerName State City  Count Order Date
433  B-25616  15-04-2018        Kanak   Goa  Goa                 1
434  B-25634  26-04-2018       Sanjay   Goa  Goa                 1
435  B-25652  08-05-2018      Tushina   Goa  Goa                 1
436  B-25670  25-05-2018      Charika   Goa  Goa                 1
437  B-25706  01-07-2018     Swetlana   Goa  Goa                 1
438  B-25742  03-08-2018       Ashwin   Goa  Goa                 1
439  B-25760  24-08-2018        Pooja   Goa  Goa                 1
440  B-25850  05-11-2018     Abhishek   Goa  Goa                 1
441  B-25868  18-11-2018       Vikash   Goa  Goa                 1
442  B-25940  06-01-2019        Vivek   Goa  Goa                 1
443  B-26026  19-02-2019        Kanak   Goa  Goa                 1
444  B-26044  02-03-2019       Sanjay   Goa  Goa                 1
445  B-26062  15-03-2019      Tushina   Goa  Goa                 1
446  B-26089  26-03-2019        Kanak   Goa  Goa                 1